# AllowInteractiveSettings Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..AllowInteractiveSettings Property
SpatialFieldManager Class See Also
---
If true interactive settings dialog and pick deletion are allowed.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool AllowInteractiveSettings { get; set; }
```

Visual Basic
---
```text
Public Property AllowInteractiveSettings As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AllowInteractiveSettings {
	bool get ();
	void set (bool value);
}
```

# Remarks
Note that SpatialFieldManager cannot be deleted if this property is set to false.
# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace